GD32-MCU-IOT/gd32_rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_spi.c
#ifdef BSP_USING_SPI4
    {
        .spi_periph = SPI4,
        .spi_clk = RCU_SPI4,
        .irqn = SPI4_IRQn,
        .bus_name = "spi4",
        .spi_bus = &spi_bus4,
    },
#endif /* BSP_USING_SPI4 */

#ifdef BSP_USING_SPI5
    {
        .spi_periph = SPI5,
        .spi_clk = RCU_SPI5,
        .irqn = SPI5_IRQn,
        .bus_name = "spi5",
        .spi_bus = &spi_bus5,
    },
#endif /* BSP_USING_SPI5 */
};

#endif

/* private rt-thread spi ops function */
static rt_err_t spi_configure(struct rt_spi_device* device, struct rt_spi_configuration* configuration);
static rt_ssize_t spixfer(struct rt_spi_device* device, struct rt_spi_message* message);

static struct rt_spi_ops gd32_spi_ops =
{
    .configure = spi_configure,
    .xfer = spixfer,
};

#if !defined(SOC_SERIES_GD32H75E) && !defined(SOC_SERIES_GD32E51x) && !defined(SOC_SERIES_GD32F3x0) \
 && !defined(SOC_SERIES_GD32F50x) && !defined(SOC_SERIES_GD32G5x3) && !defined(SOC_SERIES_GD32C11x) \
 && !defined(SOC_SERIES_GD32L23x) && !defined(SOC_SERIES_GD32E11x) && !defined(SOC_SERIES_GD32H77x) \
 && !defined(SOC_SERIES_GD32M53x) && !defined(SOC_SERIES_GD32H7xx) && !defined(SOC_SERIES_GD32F5xx)
/**
* @brief SPI Initialization
* @param gd32_spi: SPI BUS
* @retval None
*/
static void gd32_spi_init(struct gd32_spi *gd32_spi)
{
    /* enable SPI clock */
    rcu_periph_clock_enable(gd32_spi->spi_clk);
    rcu_periph_clock_enable(gd32_spi->sck_gpio_clk);
    rcu_periph_clock_enable(gd32_spi->miso_gpio_clk);
    rcu_periph_clock_enable(gd32_spi->mosi_gpio_clk);

#if defined (SOC_SERIES_GD32F4xx) || defined (SOC_SERIES_GD32H7xx) \
 || defined (SOC_SERIES_GD32E23x)
    /*GPIO pin configuration*/
    gpio_af_set(gd32_spi->sck_spi_port, gd32_spi->alt_func_num, gd32_spi->sck_pin);
    gpio_af_set(gd32_spi->miso_spi_port, gd32_spi->alt_func_num, gd32_spi->miso_pin);
    gpio_af_set(gd32_spi->mosi_spi_port, gd32_spi->alt_func_num, gd32_spi->mosi_pin);
    gpio_mode_set(gd32_spi->sck_spi_port, GPIO_MODE_AF, GPIO_PUPD_NONE, gd32_spi->sck_pin);
    gpio_mode_set(gd32_spi->miso_spi_port, GPIO_MODE_AF, GPIO_PUPD_NONE, gd32_spi->miso_pin);
    gpio_mode_set(gd32_spi->mosi_spi_port, GPIO_MODE_AF, GPIO_PUPD_NONE, gd32_spi->mosi_pin);
    #if defined (SOC_SERIES_GD32H7xx)
    gpio_output_options_set(gd32_spi->sck_spi_port, GPIO_OTYPE_PP, GPIO_OSPEED_100_220MHZ, gd32_spi->sck_pin);
    gpio_output_options_set(gd32_spi->miso_spi_port, GPIO_OTYPE_PP, GPIO_OSPEED_100_220MHZ, gd32_spi->miso_pin);
    gpio_output_options_set(gd32_spi->mosi_spi_port, GPIO_OTYPE_PP, GPIO_OSPEED_100_220MHZ, gd32_spi->mosi_pin);
    #elif defined (SOC_SERIES_GD32E23x)
    gpio_output_options_set(gd32_spi->sck_spi_port, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, gd32_spi->sck_pin);
    gpio_output_options_set(gd32_spi->miso_spi_port, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, gd32_spi->miso_pin);
    gpio_output_options_set(gd32_spi->mosi_spi_port, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, gd32_spi->mosi_pin);
    #else
    gpio_output_options_set(gd32_spi->sck_spi_port, GPIO_OTYPE_PP, GPIO_OSPEED_MAX, gd32_spi->sck_pin);
    gpio_output_options_set(gd32_spi->miso_spi_port, GPIO_OTYPE_PP, GPIO_OSPEED_MAX, gd32_spi->miso_pin);
    gpio_output_options_set(gd32_spi->mosi_spi_port, GPIO_OTYPE_PP, GPIO_OSPEED_MAX, gd32_spi->mosi_pin);
    #endif
#else
    /* Init SPI SCK MOSI */
    gpio_init(gd32_spi->sck_spi_port, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, gd32_spi->sck_pin);
    gpio_init(gd32_spi->mosi_spi_port, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, gd32_spi->mosi_pin);

    /* Init SPI MISO */
    gpio_init(gd32_spi->miso_spi_port, GPIO_MODE_IN_FLOATING, GPIO_OSPEED_50MHZ, gd32_spi->miso_pin);
#endif

}
#endif

#if defined(BSP_USING_SPI_DMA)
static void gd32_spi_dma_init(struct gd32_spi *spi_device)
{
    dma_single_data_parameter_struct dma_init_struct;
    uint32_t spi_periph = spi_device->spi_periph;
    
    /* Enable DMA clock */
    if (spi_device->dma_tx != RT_NULL && spi_device->dma_tx->periph == DMA0)
    {
        rcu_periph_clock_enable(RCU_DMA0);
    }
    if (spi_device->dma_tx != RT_NULL && spi_device->dma_tx->periph == DMA1)
    {
        rcu_periph_clock_enable(RCU_DMA1);
    }
    if (spi_device->dma_rx != RT_NULL && spi_device->dma_rx->periph == DMA0)
    {
        rcu_periph_clock_enable(RCU_DMA0);
    }
    if (spi_device->dma_rx != RT_NULL && spi_device->dma_rx->periph == DMA1)
    {
        rcu_periph_clock_enable(RCU_DMA1);
    }
    
    /* Configure DMA common parameters */
    dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
    dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
    dma_init_struct.priority = DMA_PRIORITY_HIGH;
    dma_init_struct.memory0_addr = 0;
    dma_init_struct.number = 0;
    
    /* RX DMA configuration */
    if (spi_device->dma_rx != RT_NULL)
    {
        dma_deinit(spi_device->dma_rx->periph, spi_device->dma_rx->channel);
        
        dma_init_struct.periph_memory_width = spi_device->dma_rx->data_width;
        dma_init_struct.direction = DMA_PERIPH_TO_MEMORY;
        dma_init_struct.periph_addr = (uint32_t)&SPI_DATA(spi_periph);
        
        dma_single_data_mode_init(spi_device->dma_rx->periph, spi_device->dma_rx->channel, &dma_init_struct);
        dma_channel_subperipheral_select(spi_device->dma_rx->periph, spi_device->dma_rx->channel, spi_device->dma_rx->subperiph);
        dma_circulation_disable(spi_device->dma_rx->periph, spi_device->dma_rx->channel);
        dma_channel_disable(spi_device->dma_rx->periph, spi_device->dma_rx->channel);
    }
    
    /* TX DMA configuration */
    if (spi_device->dma_tx != RT_NULL)
    {
        dma_deinit(spi_device->dma_tx->periph, spi_device->dma_tx->channel);
        
        dma_init_struct.periph_memory_width = spi_device->dma_tx->data_width;
        dma_init_struct.direction = DMA_MEMORY_TO_PERIPH;
        dma_init_struct.periph_addr = (uint32_t)&SPI_DATA(spi_periph);
        
        dma_single_data_mode_init(spi_device->dma_tx->periph, spi_device->dma_tx->channel, &dma_init_struct);
        dma_channel_subperipheral_select(spi_device->dma_tx->periph, spi_device->dma_tx->channel, spi_device->dma_tx->subperiph);
        dma_circulation_disable(spi_device->dma_tx->periph, spi_device->dma_tx->channel);
        dma_channel_disable(spi_device->dma_tx->periph, spi_device->dma_tx->channel);
    }
}

/**
 * @brief Disable DMA channels and clear flags
 * @param spi_device: SPI device structure
 * @param spi_periph: SPI peripheral
 * @retval None
 */
rt_inline void gd32_spi_dma_cleanup(struct gd32_spi *spi_device, uint32_t spi_periph)
{
    if (spi_device->dma_rx != RT_NULL)
    {
        dma_channel_disable(spi_device->dma_rx->periph, spi_device->dma_rx->channel);
        dma_flag_clear(spi_device->dma_rx->periph, spi_device->dma_rx->channel, DMA_FLAG_FTF);
        spi_dma_disable(spi_periph, SPI_DMA_RECEIVE);
    }

